In [25]:
import pandas as pd

### 1. Load Dataset

In [26]:
train = pd.read_csv('./titanic/train.csv', index_col="PassengerId")
print(train.shape)
train.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
test = pd.read_csv('./titanic/test.csv', index_col="PassengerId")
print(test.shape)
test.head()

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [28]:
# 4 - 2

In [29]:
# 잘하는 ds VS 못하는 ds -> 습관의 차이다 툴의 차이가 아니라. 항상 하나하나를 출력해서 눈으로 확인한다

In [30]:
# 4 - 3 ->  4 - 4   ,,    3은 순서만 설명함

### 2. Preprocessing

In [31]:
# Encode sex 남자는 0 여자는 1

In [32]:
# train['Sex']  # 수학공식으로 돌아가는데, 문자열은 넣을 수없다
train['Sex_encode'] = train['Sex'].replace('male', 0).replace('female',1)
train[['Sex','Sex_encode']].head()

                Sex  Sex_encode
PassengerId
1              male           0
2            female           1
3            female           1
4            female           1
5              male           0

In [33]:
test['Sex_encode'] = test['Sex'].replace('male', 0).replace('female',1)
test[['Sex', 'Sex_encode']].head()

                Sex  Sex_encode
PassengerId
892            male           0
893          female           1
894            male           0
895            male           0
896          female           1

In [ ]:
# encode Embarked

In [68]:
# train['Embarked'].replace('S',1).replace('C',0).replace('Q', 2)
# 만약 C 0, S 1, Q 2 라고 했을 떄, 머신러닝 기계가 오해할 수가 있따
#  S + S = Q ? 
# 2 * S = Q ?    이런 개떡같은 ㅜㅜㅜ
# sex처럼 종류가 2가지라면 갠춘함

# 3가지가 넘어가면 One Hot Encoding을 해 줘야 한다
#  True == 1, False == 0 을 이용하는거다 
#  C = [1,0,0]
#  S = [0,1,0]
#  Q = [0,0,1]

#  C = [True, False, False]
#  S = [False, True, False]
#  Q = [False, False, True]

train['Embarked_C'] = train['Embarked'] == 'C'
train['Embarked_S'] = train['Embarked'] == 'S'
train['Embarked_Q'] = train['Embarked'] == 'Q'

train[['Embarked', 'Embarked_C','Embarked_S','Embarked_Q']].head()


##  주의 !!! train 데이터를 전처리했다면, test도 반드시 해 줘야 한다. 데이터를 동일시 작업!!!!

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                  S       False        True       False
2                  C        True       False       False
3                  S       False        True       False
4                  S       False        True       False
5                  S       False        True       False

In [67]:
test['Embarked_C'] = test['Embarked'] == 'C'
test['Embarked_S'] = test['Embarked'] == 'S'
test['Embarked_Q'] = test['Embarked'] == 'Q'

test[['Embarked', 'Embarked_C','Embarked_S','Embarked_Q']].head()

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892                Q       False       False        True
893                S       False        True       False
894                Q       False       False        True
895                S       False        True       False
896                S       False        True       False

In [34]:
# Fill in missing Fare

In [35]:
# 4 - 5

In [39]:
# test['Fare'].isnull()
test['Fare'] = test['Fare'].fillna(0) # 이거는 표로 나타내면 안되네 
test[test['Fare'].isnull()] 
# train 데이터의 평균을 넣어주는게 보통적이긴 함. 근데 이거는 고작 1개니까

#####  keyerror 진짜 아오 ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

Empty DataFrame
Columns: [Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Sex_encode]
Index: []

### 3. Train

In [ ]:
# 4 - 6

In [40]:
# Feature - 정답을 위해 필요한 데이터들
# Label - Survived, 우리가 맞춰야 하는 정답

In [69]:
feature_names = ['Pclass', 'Sex_encode', 'Fare', 'Embarked_C','Embarked_S','Embarked_Q']
feature_names

['Pclass', 'Sex_encode', 'Fare', 'Embarked_C', 'Embarked_S', 'Embarked_Q']

In [70]:
x_train = train[feature_names]
x_train.head()

             Pclass  Sex_encode     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                 3           0   7.2500       False        True       False
2                 1           1  71.2833        True       False       False
3                 3           1   7.9250       False        True       False
4                 1           1  53.1000       False        True       False
5                 3           0   8.0500       False        True       False

In [71]:
x_test = test[feature_names]
x_test.head()

             Pclass  Sex_encode     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892               3           0   7.8292       False       False        True
893               3           1   7.0000       False        True       False
894               2           0   9.6875       False       False        True
895               3           0   8.6625       False        True       False
896               3           1  12.2875       False        True       False

In [72]:
# 4 - 7

In [73]:

label_name = 'Survived'
y_train = train[label_name]
y_train.head()
# test는 없다. test는 학습해서 맞춰야 할 부분임

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

### 4. Use Decision Tree

In [74]:
# 4 - 8
# 이미 만들어져 잇는 걸 가져다 쓸 거다 이걸 구현체라고 함
# 싸이킷런, 머신러닝 관련된 모든 패키지가 다 있음
# scikit-learn == sklearn 이라고 축약 가능
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier(max_depth=5)
model

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=5, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [75]:
# 4 - 9

In [76]:
# 1) fit(train)      ------->     2) predict(test)
model.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=5, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [77]:
# 1) fit(train)      ------->     2) predict(test)
prediction = model.predict(x_test)
prediction[0:5]

array([0, 0, 0, 0, 1], dtype=int64)

In [78]:
# 4 - 10

### 5. Predict and Submit

In [79]:
submit = pd.read_csv('./titanic/gender_submission.csv', index_col='PassengerId')
submit['Survived'] = prediction
# 간과해선 안 될 게, 넣으려는 데이터와 틀을 가진 데이터 간의 크기가 정확히 일치해야 한다.
# 1개라도 틀리면 들어가지 않아
submit

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 1
...               ...
1305                0
1306                1
1307                0
1308                0
1309                0

[418 rows x 1 columns]

In [80]:
# 저장하긔
submit.to_csv('./titanic/decision-tree5.csv')

In [ ]:
# 4 - 11  -> train 쪽에서 encode embarked 했다
# 4 - 12 과제 설명